{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "hidden_dim": 3072,
  "id2label": {
    "0": "Data Retention",
    "1": "Data Security",
    "2": "Do Not Track",
    "3": "First Party Collection/Use",
    "4": "International and Specific Audiences",
    "5": "Policy Change",
    "6": "Third Party Sharing/Collection",
    "7": "User Access, Edit and Deletion",
    "8": "User Choice/Control"
  },
  "initializer_range": 0.02,
  "label2id": {
    "Data Retention": 0,
    "Data Security": 1,
    "Do Not Track": 2,
    "First Party Collection/Use": 3,
    "International and Specific Audiences": 4,
    "Policy Change": 5,
    "Third Party Sharing/Collection": 6,
    "User Access, Edit and Deletion": 7,
    "User Choice/Control": 8
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "multi_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "transformers_version": "4.57.1",
  "vocab_size": 30522
}
